backend/controllers/AdminUserDashboardController.php

SELECT COUNT(*) FROM `student_upload` WHERE (`uid`=4) AND ((`df`=0) AND (`created_at` BETWEEN 1572472800 AND 1573077600))
SELECT COUNT(*) FROM `student_listening` WHERE (`uid`=4) AND (`created_at` BETWEEN 1572472800 AND 1573077600)
---
    public function actionBestStudents() {
        $student_join_class = \common\models\StudentJoinedClass::find()->where(['uid' => \Yii::$app->user->id])->one();
        $students_arr = [];
        if ($student_join_class) {
            $students = \common\models\StudentJoinedClass::find()->where(['class_id' => $student_join_class->class_id])->all();
            if ($students) {
                foreach ($students as $student) {
                    $user_uploads_count = \common\models\StudentUpload::find()->where(['uid' => $student->uid])->weekly()->count();
                    $user_listening_count = \common\models\StudentListening::find()->where(['uid' => $student->uid])->weekly()->count();

UPDATE `message` SET `read`=1 WHERE (`uid`=4) AND (`read`=0) AND (`type`=1)
SELECT * FROM `message` WHERE `uid`=4 ORDER BY `created_at`
---
    public function actionMessages() {
        $user_id = Yii::$app->user->id;
        \common\models\Message::updateAll(['read' => \common\models\Enum::ANSWER_YES], ['uid' => $user_id, 'read' => \common\models\Enum::ANSWER_NO, 'type' => \common\models\Message::MESSAGE_ADMIN]);
        $messages = \common\models\Message::find()->where(['uid' => $user_id])->orderBy('created_at ASC')->all();