backend/views/layouts/left.php

SELECT COUNT(*) FROM `message` WHERE (`uid`=4) AND (`read`=0) AND (`type`=1)
---
                    <a href=javascript:;> <i class="fa fa-users"></i> <span>Menu</span> </a>
                    <?php
                    $span = '';
                    if ($count = common\models\Message::find()->where(['uid' => Yii::$app->user->id, 'read' => \common\models\Enum::ANSWER_NO, 'type' => \common\models\Message::MESSAGE_ADMIN])->count())