backend/views/admin-user-dashboard/profile.php

    'model' => $model,
    'hover' => true,
    'bordered' => true,
    'panel' => [
        'heading' => $model->userProfile->first_name . ' ' . $model->userProfile->last_name . ' ( ' . $model->username . ' )',
        'type' => DetailView::TYPE_PRIMARY,
//        'headingOptions' => ['template' => '{title}']
    ],
---
SELECT * FROM `user_profile` WHERE `uid`=4